Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Synchronized" classes can be useful when you need to prevent all access to a collection via a single lock, at the expense of poorer scalability.
zh_cn: 需要通过单个锁不允许对 collection 的所有访问时，“同步”类是很有用的，其代价是较差的可伸缩性。

source: (A null return can also indicate that the map previously associated null with key.)
zh_cn: （返回 null 还可能表示该映射之前将 null 与 key 关联。）

source: (A structural modification is any operation that adds or deletes one or more mappings; merely changing the value associated with a key that an instance already contains is not a structural modification.)
zh_cn: （结构上的修改是指添加或删除一个或多个映射关系的任何操作；仅改变与实例已经包含的键关联的值不是结构上的修改。）

source: (Among known examples are sets of Float keys holding consecutive whole numbers in small tables.)
zh_cn: （在已知的例子中有：在小表中，以 Float 为键的集合持有连续的整数）。

source: (And the value of the maximumPoolSize therefore doesn't have any effect.)
zh_cn: （因此，maximumPoolSize 的值也就无效了。）

source: (Because atomic variables are expected to be mutated, they are poor choices for hash table keys.)
zh_cn: （因为原子变量是可变的，所以对于哈希表键来说，它们不是好的选择。）

source: (Because atomic variables are expected to be mutated, they are poor choices for hash table keys.) Additionally, classes are provided only for those types that are commonly useful in intended applications.
zh_cn: （因为原子变量是可变的，所以对于哈希表键来说，它们不是好的选择。）另外，仅为那些通常在预期应用程序中使用的类型提供类。

source: (Extraneous whitespace characters are not permitted.)
zh_cn: （不允许使用额外的空白字符。）

source: (For more information on this topic, see Section 3.2.3 in Doug Lea's "Concurrent Programming in Java (Second Edition)" (Addison-Wesley, 2000), or Item 50 in Joshua Bloch's "Effective Java Programming Language Guide" (Addison-Wesley, 2001).
zh_cn: （有关这一主题的更多信息，请参阅 Doug Lea 撰写的 Concurrent Programming in Java (Second Edition) (Addison-Wesley, 2000) 中的第 3.2.3 节或 Joshua Bloch 撰写的 Effective Java Programming Language Guide (Addison-Wesley, 2001) 中的第 50 项。

source: (If neither of these apply, we may waste about a factor of two in time and space compared to taking no precautions.
zh_cn: （如果这些都不适用，那么与未采取预防措施相比，我们可能浪费大约两倍的时间和空间。

source: (In the case of annotation member values, this is a recursive definition.)
zh_cn: （对于 annotation 成员值，这是一种递归定义。）

source: (Note that this definition is recursive for annotation typed members.)
zh_cn: （注意，此定义对于 annotation 类型的成员是递归的。）

source: (Otherwise the table is resized if too many nodes in a bin.)
zh_cn: （否则，如果 bin 中的节点太多，则调整表的大小。）

source: (Refer to the definition of the U+n notation in the Unicode Standard.)
zh_cn: （请参阅 Unicode 标准中 U+n 表示法的定义。）

source: (Returns an array of length zero if no annotations are directly present on this element.) The caller of this method is free to modify the returned array; it will have no effect on the arrays returned to other callers.
zh_cn: （如果没有注释直接存在于此元素上，则返回长度为零的一个数组。）该方法的调用者可以随意修改返回的数组；这不会对其他调用者返回的数组产生任何影响。

source: (Returns an array of length zero if this element has no annotations.) The caller of this method is free to modify the returned array; it will have no effect on the arrays returned to other callers.
zh_cn: （如果此元素没有注释，则返回长度为零的数组。）该方法的调用者可以随意修改返回的数组；这不会对其他调用者返回的数组产生任何影响。

source: (See ConcurrentModificationException).
zh_cn: （请参阅 ConcurrentModificationException）。

source: (See below for TreeNode subclass, and in LinkedHashMap for its Entry subclass.)
zh_cn: （请参阅下面的 TreeNode 子类，以及 LinkedHashMap 中的 Entry 子类。）

source: (Such spurious failures may for example be due to memory contention effects that are unrelated to whether the expected and current values are equal.)
zh_cn: （例如，这样的虚假失败可能是由于内存争用的结果，该争用与期望值和当前值是否相等无关）。

source: (Such spurious failures may for example be due to memory contention effects that are unrelated to whether the expected and current values are equal.) Additionally weakCompareAndSet does not provide ordering guarantees that are usually needed for synchronization control.
zh_cn: （例如，这样的虚假失败可能是由于内存争用的结果，该争用与期望值和当前值是否相等无关）。此外，weakCompareAndSet 不提供通常需要同步控制的排序保证。

source: (The HashMap class is roughly equivalent to Hashtable, except that it is unsynchronized and permits nulls.)
zh_cn: （除了非同步和允许使用 null 之外，HashMap 类与 Hashtable 大致相同。）

source: (The javadoc description is true upon serialization.
zh_cn: （在序列化时，javadoc 描述是真实的。

source: (The specification for the persistent collection should indicate that it is capable of throwing such exceptions.)
zh_cn: （持久集合的规范应该指示它能够抛出这种异常。）

source: (The test triggers somewhere between 2 and 6 nodes, depending on tree structure).
zh_cn: （测试触发 2 到 6 个节点之间，取决于树结构）。

source: (The value returned by this method may differ from the one returned by the getClass() method for enum constants with constant-specific class bodies.)
zh_cn: （由该方法返回的值不同于由 Object.getClass() 方法返回的值，getClass() 方法用于带有特定常量的类主体的枚举常量。）

source: (There can be at most one such mapping.)
zh_cn: （最多只能有一个这样的映射关系。）

source: (There is one overloading for each primitive type, and one for object reference types.)
zh_cn: （各种基本类型和对象引用类型分别对应一个重载。）

source: (This also requires that a map instance be passed to some utility methods that may create new nodes.)
zh_cn: （这也要求映射实例被传递给可能创建新节点的一些实用方法。）

source: (This implies that x.compareTo(y) must throw an exception iff y.compareTo(x) throws an exception.)
zh_cn: （这意味着如果 y.compareTo(x) 抛出一个异常，则 x.compareTo(y) 也要抛出一个异常。）

source: (This is typically implemented by converting the internal address of the object into an integer, but this implementation technique is not required by the JavaTM programming language.)
zh_cn: （这一般是通过将该对象的内部地址转换成一个整数来实现的，但是 JavaTM 编程语言不需要这种实现技巧。）

source: (This sequence will be lengthened to accommodate the specified String if necessary.)
zh_cn: （如果需要，序列将延长，以适应指定的字符串。）

source: (Unlike the == operator, NaN is considered equal to itself, and 0.0 unequal to -0.0.)
zh_cn: （与 == 运算符不同，NaN 被认为等于其自身，并且 0.0 不等于 -0.0。）

source: (Unlike the == operator, NaN is considered equal to itself, and 0.0f unequal to -0.0f.)
zh_cn: （与 == 运算符不同，NaN 被认为等于其自身，并且 0.0f 不等于 -0.0f。）

source: (We also tolerate length zero in some operations to allow bootstrapping mechanics that are currently not needed.)
zh_cn: (在某些操作中，我们还允许长度为零，以允许当前不需要的引导机制。)

source: (We conservatively check generic types via reflection to validate this -- see method comparableClassFor).
zh_cn: 我们保守地通过反射检查泛型类型来验证是否是 Comparable，见 comparableClassFor 方法。

source: (else is already treeified)
zh_cn: (否则已经 treeified)

source: (if zero, use defaults)
zh_cn: (如果为零，则使用默认值)

source: Characters whose code points are greater than U+FFFF are called supplementary characters.
zh_cn: 代码点大于 U+FFFF 的字符称为增补字符。

source: Chapter 17 of The Java™ Language Specification defines the happens-before relation on memory operations such as reads and writes of shared variables.
zh_cn: The Java™ Language Specification 第 17 章 定义了内存操作（如共享变量的读写）的 happen-before 关系。

source: Buffers, which are containers for data;
zh_cn: 缓冲区，它们是数据容器；

source: Channels of various types, which represent connections
zh_cn: 各种类型的 通道，

source: Charsets and their associated decoders and encoders,
zh_cn: 字符集 及其相关 解码器 和 编码器，

source: The set of characters from U+0000 to U+FFFF is sometimes referred to as the Basic Multilingual Plane (BMP).
zh_cn: 从 U+0000 到 U+FFFF 的字符集有时也称为 Basic Multilingual Plane (BMP)。

source: Extension example.
zh_cn: 扩展示例。

source: Implementations. Classes ThreadPoolExecutor and ScheduledThreadPoolExecutor provide tunable, flexible thread pools.
zh_cn: 实现。类 ThreadPoolExecutor 和 ScheduledThreadPoolExecutor 提供可调的、灵活的线程池。

source: Interfaces. Executor is a simple standardized interface for defining custom thread-like subsystems, including thread pools, asynchronous I/O, and lightweight task frameworks.
zh_cn: 接口。Executor 是一个简单的标准化接口，用于定义类似于线程的自定义子系统，包括线程池、异步 IO 和轻量级任务框架。

source: Most programmers should use the toString() method in preference to this one, as the toString method may return a more user-friendly name. This method is designed primarily for use in specialized situations where correctness depends on getting the exact name, which will not vary from release to release.
zh_cn: 与此方法相比，大多数程序员应该优先考虑使用 toString() 方法，因为 toString 方法返回更加用户友好的名称。该方法主要设计用于特殊情形，其正确性取决于获取正确的名称，其名称不会随版本的改变而改变。

source: The actual result type is Class<? extends |X|> where |X| is the erasure of the static type of the expression on which getClass is called. For example, no cast is required in this code fragment:
zh_cn: 实际结果类型是 Class<? extends |X|>，其中 |X| 表示清除表达式中的静态类型，该表达式调用 getClass。例如，以下代码片段中不需要强制转换：

source: CountDownLatch is a very simple yet very common utility for blocking until a given number of signals, events, or conditions hold.
zh_cn: CountDownLatch 是一个极其简单但又极其常用的实用工具，用于在保持给定数目的信号、事件或条件前阻塞执行。

source: DatagramSocket is a UDP endpoint API and is used to send and receive datagram packets.
zh_cn: DatagramSocket 是 UDP 端点 API，用于 发送 和 接收 数据包。

source: HttpURLConnection is a subclass of URLConnection and provides some additional functionalities specific to the HTTP protocol.
zh_cn: HttpURLConnection 是 URLConnection 的子类，提供一些特定于 HTTP 协议的附加功能。

source: Inet4Address for IPv4 addresses.
zh_cn: 用于 IPv4 地址的 Inet4Address。

source: Inet6Address for IPv6 addresses.
zh_cn: 用于 IPv6 地址的 Inet6Address 。

source: MulticastSocket is a subclass of DatagramSocket used when dealing with multicast groups.
zh_cn: MulticastSocket 是 DatagramSocket 的子类，在处理多播组时使用。

source: Object.wait with no timeout
zh_cn: 不带超时值的 Object.wait

source: Semaphore is a classic concurrency tool.
zh_cn: Semaphore 是一个经典的并发工具。

source: ServerSocket is a TCP server API, and will typically accept connections from client sockets.
zh_cn: ServerSocket 是 TCP 服务器 API，通常 接受 源于客户端套接字的连接。

source: Socket is a TCP client API, and will typically be used to connect to a remote host.
zh_cn: Socket 是 TCP 客户端 API，通常用于 连接 远程主机。

source: Thread.join with no timeout
zh_cn: 不带超时值的 Thread.join

source: URI is the class representing a Universal Resource Identifier, as specified in RFC 2396.
zh_cn: URI 是表示在 RFC 2396 中指定的统一资料标识符的类。

source: URL is the class representing a Universal Resource Locator, which is both an older concept for URIs and a means to access the resources.
zh_cn: URL 是表示统一资源定位符的类，它既是 URI 的旧式概念又是访问资源的方法。

source: URLConnection is created from a URL and is the communication link used to access the resource pointed by the URL.
zh_cn: URLConnection 是根据 URL 创建的，是用于访问 URL 所指向资源的通信链接。

source: AccessibleObject allows suppression of access checks if the necessary ReflectPermission is available.
zh_cn: 如果必需的 ReflectPermission 可用，则 AccessibleObject 允许抑制访问检查。

source: Array permits widening conversions to occur during a get or set operation, but throws an IllegalArgumentException if a narrowing conversion would occur.
zh_cn: Array 允许在执行 get 或 set 操作期间进行扩展转换，但如果发生收缩转换，则抛出 IllegalArgumentException。

source: Array provides static methods to dynamically create and access arrays.
zh_cn: Array 提供动态创建和访问数组的静态方法。

source: Builder is used to build instances of Locale from values configured by the setters.
zh_cn: Builder 用于根据 setters 配置的值构建 Locale 的实例。

source: Class has no public constructor.
zh_cn: Class 没有公共构造方法。

source: Condition factors out the Object monitor methods (wait, notify and notifyAll) into distinct objects to give the effect of having multiple wait-sets per object, by combining them with the use of arbitrary Lock implementations.
zh_cn: Condition 将 Object 监视器方法（wait、notify 和 notifyAll）分解成截然不同的对象，以便通过将这些对象与任意 Lock 实现组合使用，为每个对象提供多个等待 set（wait-set）。

source: Constructor permits widening conversions to occur when matching the actual parameters to newInstance() with the underlying constructor's formal parameters, but throws an IllegalArgumentException if a narrowing conversion would occur.
zh_cn: Constructor 允许在将实参与带有底层构造方法的形参的 newInstance() 匹配时进行扩展转换，但是如果发生收缩转换，则抛出 IllegalArgumentException。

source: Constructor provides information about, and access to, a single constructor for a class.
zh_cn: Constructor 提供关于类的单个构造方法的信息以及对它的访问权限。

source: DateFormat is an abstract class for date/time formatting subclasses which formats and parses dates or time in a language-independent manner.
zh_cn: DateFormat 是日期/时间格式化子类的抽象类，它以与语言无关的方式格式化并解析日期或时间。

source: DateFormatSymbols is a public class for encapsulating localizable date-time formatting data, such as the names of the months, the names of the days of the week, and the time zone data.
zh_cn: DateFormatSymbols 是一个公共类，用于封装可本地化的日期-时间格式化数据，如月名、星期几的名称和时区数据。

source: DecimalFormat is a concrete subclass of NumberFormat that formats decimal numbers.
zh_cn: DecimalFormat 是 NumberFormat 的一个具体子类，用于格式化十进制数字。

source: FieldPosition is a simple class used by Format and its subclasses to identify fields in formatted output.
zh_cn: FieldPosition 是 Format 及其子类用于在格式输出中标识字段的简单类。

source: Format is an abstract base class for formatting locale-sensitive information such as dates, messages, and numbers.
zh_cn: Format 是一个用于格式化语言环境敏感的信息（如日期、消息和数字）的抽象基类。

source: GenericArrayType represents an array type whose component type is either a parameterized type or a type variable.
zh_cn: GenericArrayType 表示一种数组类型，其组件类型为参数化类型或类型变量。

source: GregorianCalendar is a concrete subclass of Calendar and provides the standard calendar system used by most of the world.
zh_cn: GregorianCalendar 是 Calendar 的一个具体子类，提供了世界上大多数国家/地区使用的标准日历系统。

source: InvocationHandler is the interface implemented by the invocation handler of a proxy instance.
zh_cn: InvocationHandler 是代理实例的 调用处理程序 实现的接口。

source: ListResourceBundle is an abstract subclass of ResourceBundle that manages resources for a locale in a convenient and easy to use list.
zh_cn: ListResourceBundle 是 ResourceBundle 的一个抽象类，用于管理方便而又易于使用的列表中的语言环境资源。

source: Lock implementations provide more extensive locking operations than can be obtained using synchronized methods and statements.
zh_cn: Lock 实现提供了比使用 synchronized 方法和语句可获得的更广泛的锁定操作。

source: MessageFormat provides a means to produce concatenated messages in a language-neutral way.
zh_cn: MessageFormat 提供了以与语言无关方式生成连接消息的方式。

source: NumberFormat is the abstract base class for all number formats.
zh_cn: NumberFormat 是所有数值格式的抽象基类。

source: Package objects contain version information about the implementation and specification of a Java package.
zh_cn: Package 对象包含有关 Java 包的实现和规范的版本信息。

source: ParsePosition is a simple class used by Format and its subclasses to keep track of the current position during parsing.
zh_cn: ParsePosition 是 Format 及其子类所使用的简单类，用来在解析过程中跟踪当前位置。

source: PropertyResourceBundle is a concrete subclass of ResourceBundle that manages resources for a locale using a set of static strings from a property file.
zh_cn: PropertyResourceBundle 是 ResourceBundle 的一个具体子类，它使用属性文件中的静态字符串集来管理语言环境资源。

source: Proxy.newProxyInstance throws IllegalArgumentException for the same reasons that Proxy.getProxyClass does.
zh_cn: Proxy.newProxyInstance 抛出 IllegalArgumentException，原因与 Proxy.getProxyClass 相同。

source: Proxy provides static methods for creating dynamic proxy classes and instances, and it is also the superclass of all dynamic proxy classes created by those methods.
zh_cn: Proxy 提供用于创建动态代理类和实例的静态方法，它还是由这些方法创建的所有动态代理类的超类。

source: ResourceBundle.Control defines a set of callback methods that are invoked by the ResourceBundle.getBundle factory methods during the bundle loading process.
zh_cn: ResourceBundle.Control 定义一个回调方法集，它在包加载进程中由 ResourceBundle.getBundle 工厂方法调用。

source: RuntimeException is the superclass of those exceptions that can be thrown during the normal operation of the Java Virtual Machine.
zh_cn: RuntimeException 是那些可能在 Java 虚拟机正常运行期间抛出的异常的超类。

source: SimpleDateFormat is a concrete class for formatting and parsing dates in a locale-sensitive manner.
zh_cn: SimpleDateFormat 是一个以与语言环境有关的方式来格式化和解析日期的具体类。

source: SimpleTimeZone is a concrete subclass of TimeZone that represents a time zone for use with a Gregorian calendar.
zh_cn: SimpleTimeZone 是 TimeZone 的具体子类，表示一个使用格里高利历的时区。

source: StringJoiner is used to construct a sequence of characters separated by a delimiter and optionally starting with a supplied prefix and ending with a supplied suffix.
zh_cn: StringJoiner 用于构建由分隔符隔开并任选地开始与供给前缀和使用所提供的后缀结束的字符序列。

source: TimeZone represents a time zone offset, and also figures out daylight savings.
zh_cn: TimeZone 表示时区偏移量，也可以计算夏令时。

source: compareAndSet and all other read-and-update operations such as getAndIncrement have the memory effects of both reading and writing volatile variables.
zh_cn: compareAndSet 和所有其他的读取和更新操作（如 getAndIncrement）都有读取和写入 volatile 变量的内存效果。

source: get has the memory effects of reading a volatile variable.
zh_cn: get 具有读取 volatile 变量的内存效果。

source: lazySet has the memory effects of writing (assigning) a volatile variable except that it permits reorderings with subsequent (but not previous) memory actions that do not themselves impose reordering constraints with ordinary non-volatile writes.
zh_cn: 除了允许使用后续（但不是以前的）内存操作，其自身不施加带有普通的非 volatile 写入的重新排序约束，lazySet 具有写入（分配）volatile 变量的内存效果。

source: set has the memory effects of writing (assigning) a volatile variable.
zh_cn: set 具有写入（分配）volatile 变量的内存效果。

source: true if the class is a proxy class and false otherwise
zh_cn: 如该类为代理类，则为 true，否则为 false

source: true if the value was replaced
zh_cn: true 如果该值被替换

source: weakCompareAndSet atomically reads and conditionally writes a variable but does not create any happens-before orderings, so provides no guarantees with respect to previous or subsequent reads and writes of any variables other than the target of the weakCompareAndSet.
zh_cn: weakCompareAndSet 以原子方式读取和有条件地写入变量但不 创建任何 happen-before 排序，因此不提供与除 weakCompareAndSet 目标外任何变量以前或后续读取或写入操作有关的任何保证。

source: NullPointerException objects may be constructed by the virtual machine as if suppression were disabled and/or the stack trace was not writable.
zh_cn: NullPointerException 对象可以由虚拟机被构造为如果 抑制被禁用和/或堆栈跟踪是不可写。

source: UndeclaredThrowableException extends RuntimeException, so it is an unchecked exception that wraps a checked exception.
zh_cn: UndeclaredThrowableException 扩展了 RuntimeException，因此它是一个包装已检查异常的未经检查的异常。

source: AtomicReferenceFieldUpdater, AtomicIntegerFieldUpdater, and AtomicLongFieldUpdater are reflection-based utilities that provide access to the associated field types.
zh_cn: AtomicReferenceFieldUpdater、AtomicIntegerFieldUpdater 和 AtomicLongFieldUpdater 是基于反射的实用工具，可以提供对关联字段类型的访问。

source: ExecutorService provides a more complete asynchronous task execution framework.
zh_cn: ExecutorService 提供了多个完整的异步任务执行框架。

source: Direct handoffs. A good default choice for a work queue is a SynchronousQueue that hands off tasks to threads without otherwise holding them.
zh_cn: 直接提交。工作队列的默认选项是 SynchronousQueue，它将任务直接提交给线程而不保持它们。

source: This class was deprecated in API level 1.
zh_cn: 此类在 API 级别 17 中已弃用。

source: Unbounded queues. Using an unbounded queue (for example a LinkedBlockingQueue without a predefined capacity) will cause new tasks to wait in the queue when all corePoolSize threads are busy.
zh_cn: 无界队列。使用无界队列（例如，不具有预定义容量的 LinkedBlockingQueue）将导致在所有 corePoolSize 线程都忙时新任务在队列中等待。

source: Bounded queues. A bounded queue (for example, an ArrayBlockingQueue) helps prevent resource exhaustion when used with finite maximumPoolSizes, but can be more difficult to tune and control.
zh_cn: 有界队列。当使用有限的 maximumPoolSizes 时，有界队列（如 ArrayBlockingQueue）有助于防止资源耗尽，但是可能较难调整和控制。

source: A High Level API, which deals with the following abstractions:
zh_cn: 高级 API，用于处理以下抽象：

source: A Low Level API, which deals with the following abstractions:
zh_cn: 低级 API，用于处理以下抽象：

source: Addresses, which are networking identifiers, like IP addresses.
zh_cn: 地址，也就是网络标识符，如 IP 地址。

source: Connections, which represents connections to the resource pointed to by URLs.
zh_cn: 连接，表示到 URL所指向资源的连接。

source: Interfaces, which describe network interfaces.
zh_cn: 接口，用于描述网络接口。

source: Selectors and selection keys, which together with
zh_cn: 选择器 和 选择键，

source: Sockets, which are basic bidirectional data communication mechanisms.
zh_cn: 套接字，也就是基本双向数据通信机制。

source: URIs, which represent Universal Resource Identifiers.
zh_cn: URI，表示统一资源标识符。

source: URLs, which represent Universal Resource Locators.
zh_cn: URL，表示统一资源定位符。

source: selectable channels define a multiplexed, non-blocking
zh_cn: 它们与 可选择信道 一起定义了 多路复用、非阻塞

source: Note that this class is not synchronized. If multiple threads access a ProcessBuilder instance concurrently, and at least one of the threads modifies one of the attributes structurally, it must be synchronized externally.
zh_cn: 注意，此类不是同步的。如果多个线程同时访问一个 ProcessBuilder，而其中至少一个线程从结构上修改了其中一个属性，它必须 保持外部同步。

source: Note that this implementation is not synchronized. If multiple threads access a hash map concurrently, and at least one of the threads modifies the map structurally, it must be synchronized externally.
zh_cn: 注意，此实现不是同步的。如果多个线程同时访问一个哈希映射，而其中至少一个线程从结构上修改了该映射，则它必须 保持外部同步。

source: Class objects for array classes are not created by class loaders, but are created automatically as required by the Java runtime.
zh_cn: 数组类的 Class 对象不是由类加载器创建的，而是由 Java 运行时根据需要自动创建。

source: true if this map contains a mapping for the specified key.
zh_cn: 如果此映射包含对于指定键的映射关系，则返回 true。

source: true if this map contains no key-value mappings
zh_cn: 如果此映射不包含键-值映射关系，则返回 true。

source: true if this map maps one or more keys to the specified value
zh_cn: 如果此映射将一个或多个键映射到指定值，则返回 true。

source: ThreadLocal instances are typically private static fields in classes that wish to associate state with a thread (e.g., a user ID or Transaction ID).
zh_cn: ThreadLocal 实例通常是类中的 private static 字段，它们希望将状态与某一个线程（例如，用户 ID 或事务 ID）相关联。

source: A blocking queue in which each insert operation must wait for a corresponding remove operation by another thread, and vice versa.
zh_cn: 一种阻塞队列，其中每个插入操作必须等待另一个线程的对应移除操作 ，反之亦然。

source: A BlockingQueue in which producers may wait for consumers to receive elements.
zh_cn: BlockingQueue 是生产者可以等待消费者接收元素的一种阻塞队列。

source: A CompletionService that uses a supplied Executor to execute tasks.
zh_cn: 使用提供的 Executor 来执行任务的 CompletionService。

source: A ConcurrentMap supporting NavigableMap operations, and recursively so for its navigable sub-maps.
zh_cn: 支持 NavigableMap 操作，且以递归方式支持其可导航子映射的 ConcurrentMap。

source: A CyclicBarrier is a resettable multiway synchronization point useful in some styles of parallel programming.
zh_cn: CyclicBarrier 是一个可重置的多路同步点，在某些并行编程风格中很有用。

source: A Deque that additionally supports blocking operations that wait for the deque to become non-empty when retrieving an element, and wait for space to become available in the deque when storing an element.
zh_cn: 支持两个附加操作的 Queue，这两个操作是：获取元素时等待双端队列变为非空；存储元素时等待双端队列中的空间变得可用。

source: A ForkJoinTask with a completion action performed when triggered and there are no remaining pending actions.
zh_cn: ForkJoinTask 触发时执行完成操作，并且没有剩余的挂起操作。

source: A Future that is Runnable.
zh_cn: 作为 Runnable 的 Future。

source: A Future that may be explicitly completed (setting its value and status), and may be used as a CompletionStage, supporting dependent functions and actions that trigger upon its completion.
zh_cn: Future 可以被显式地完成(设定其值和状态)，并且可以被用作 CompletionStage，支持有关的功能，并在完成时触发动作。

source: A Map providing thread safety and atomicity guarantees.
zh_cn: 提供线程安全和原子性保证的 Map。

source: A Map that further provides a total ordering on its keys.
zh_cn: 进一步提供关于键的 总体排序 的 Map。

source: A NavigableSet implementation based on a TreeMap.
zh_cn: 基于 TreeMap 的 NavigableSet 实现。

source: A Phaser provides a more flexible form of barrier that may be used to control phased computation among multiple threads.
zh_cn: Phaser 提供了可用于控制在多个线程之间分阶段计算屏障的更灵活的形式。

source: A Queue that additionally supports operations that wait for the queue to become non-empty when retrieving an element, and wait for space to become available in the queue when storing an element.
zh_cn: 支持两个附加操作的 Queue，这两个操作是：获取元素时等待队列变为非空，以及存储元素时等待空间变得可用。

source: A ScheduledFuture that is Runnable.
zh_cn: 作为 Runnable 的 ScheduledFuture。

source: A Set that further provides a total ordering on its elements.
zh_cn: 进一步提供关于元素的 总体排序 的 Set。
